#ifndef APP_CONFIG_H
#define APP_CONFIG_H

/**************************************************************************
 * @brief: 遥控器接收模式
 * @param: 0 直接在中断中解包
 * @param: 1 在中断中进入fifo队列，然后在referee_usart_task任务中解包
***************************************************************************/
#define	RC_FIFO_ENABLE 			1


/**************************************************************************
 * @brief: 自定义控制器构型选择
 * @param: 0 同构
 * @param: 1 xyzypr六轴
***************************************************************************/
#define SELF_CTRL_XYZYPR    1

#endif
